[
    {
        "id": "HU-001",
        "title": "Registro de usuario en la plataforma",
        "role": "Usuario/Cliente",
        "description": "Como usuario potencial, quiero registrarme en la plataforma para acceder a los servicios personalizados de búsqueda y reserva de autolavados.",
        "acceptance_criteria": [
            "El formulario de registro incluye campos para email, contraseña, nombre, apellido, y opcionalmente teléfono y fecha de nacimiento.",
            "Se valida que el email sea único en el sistema y tenga formato válido.",
            "La contraseña debe cumplir requisitos mínimos de seguridad (mínimo 8 caracteres, al menos una mayúscula, un número).",
            "Se envía un correo de verificación al email registrado.",
            "Se muestra un mensaje de error descriptivo si los campos son inválidos o el email ya existe.",
            "Tras el registro exitoso, se redirige al usuario a completar su perfil o al dashboard principal.",
            "Opción de registro mediante redes sociales (Google, Facebook) usando Clerk."
        ],
        "story_points": 5,
        "priority": "Must",
        "epic": "EPI-01",
        "dependencies": []
    },
    {
        "id": "HU-002",
        "title": "Inicio de sesión en la plataforma",
        "role": "Usuario/Cliente",
        "description": "Como usuario registrado, quiero iniciar sesión en la plataforma para acceder a mi perfil y funcionalidades personalizadas.",
        "acceptance_criteria": [
            "Soporte para login con email/contraseña a través de Clerk.",
            "Opción de \"olvidé mi contraseña\" que envía enlace de recuperación.",
            "Integración con autenticación biométrica (huella o facial) si el dispositivo móvil lo permite.",
            "Se muestra mensaje de error claro para credenciales inválidas o cuenta no verificada.",
            "Tras login exitoso, se carga el dashboard principal con datos personalizados del usuario.",
            "Soporte para \"recordar sesión\" con tokens JWT seguros.",
            "Límite de intentos fallidos (3) antes de bloqueo temporal de 15 minutos."
        ],
        "story_points": 3,
        "priority": "Must",
        "epic": "EPI-01",
        "dependencies": [
            "HU-001"
        ]
    },
    {
        "id": "HU-003",
        "title": "Recuperación de contraseña",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero recuperar mi contraseña para poder acceder a mi cuenta si la olvidé.",
        "acceptance_criteria": [
            "Enlace \"Olvidé mi contraseña\" visible en la pantalla de login.",
            "Formulario solicita el email del usuario registrado.",
            "Se envía un enlace único de restablecimiento con expiración de 1 hora.",
            "El enlace redirige a formulario para ingresar nueva contraseña.",
            "Nueva contraseña debe cumplir los mismos requisitos de seguridad del registro.",
            "Confirmación visual de que la contraseña fue cambiada exitosamente.",
            "Notificación por email al usuario informando del cambio de contraseña."
        ],
        "story_points": 3,
        "priority": "Must",
        "epic": "EPI-01",
        "dependencies": [
            "HU-001",
            "HU-002"
        ]
    },
    {
        "id": "HU-004",
        "title": "Gestión de perfil de usuario",
        "role": "Usuario/Cliente",
        "description": "Como usuario registrado, quiero editar mi perfil personal para mantener mis datos actualizados y personalizar mi experiencia.",
        "acceptance_criteria": [
            "Campos editables: foto de perfil, nombre, apellido, teléfono, fecha de nacimiento.",
            "Opción para configurar ubicación predeterminada para búsquedas.",
            "Validación de formato para teléfono y otros campos.",
            "Opción para cambiar contraseña con verificación de contraseña actual.",
            "Los cambios se guardan en la base de datos y se reflejan inmediatamente en la interfaz.",
            "Confirmación visual tras guardar cambios exitosamente.",
            "Opción para eliminar cuenta con doble confirmación."
        ],
        "story_points": 3,
        "priority": "Should",
        "epic": "EPI-01",
        "dependencies": [
            "HU-002"
        ]
    },
    {
        "id": "HU-005",
        "title": "Búsqueda de autolavados por ubicación",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero buscar autolavados cercanos a mi ubicación para encontrar opciones convenientes.",
        "acceptance_criteria": [
            "Campo de búsqueda principal acepta dirección, comuna, o ciudad.",
            "Detección automática de ubicación GPS del usuario (con permiso).",
            "Resultados se muestran ordenados por distancia (más cercano primero).",
            "Cada resultado muestra: nombre, distancia, rating, precio desde, imagen principal.",
            "Configuración de radio de búsqueda (1, 5, 10, 20 km).",
            "Actualización en tiempo real de resultados al cambiar ubicación o radio.",
            "Manejo de casos cuando no hay resultados (sugerencias de ampliar búsqueda).",
            "Integración con Google Maps API para geocodificación."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-02",
        "dependencies": []
    },
    {
        "id": "HU-006",
        "title": "Búsqueda avanzada con filtros",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero aplicar filtros avanzados a mi búsqueda para encontrar autolavados que cumplan con mis necesidades específicas.",
        "acceptance_criteria": [
            "Filtros disponibles: tipo de servicio, rango de precio, rating mínimo, horario de atención, acepta reservas.",
            "Filtros se aplican de forma dinámica sin recargar página.",
            "Indicador visual del número de filtros activos.",
            "Opción para limpiar todos los filtros con un clic.",
            "Los filtros se mantienen al navegar entre resultados.",
            "Combinación lógica de múltiples filtros (AND).",
            "Contador de resultados encontrados actualizado en tiempo real."
        ],
        "story_points": 5,
        "priority": "Should",
        "epic": "EPI-02",
        "dependencies": [
            "HU-005"
        ]
    },
    {
        "id": "HU-007",
        "title": "Visualización de mapa interactivo",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero ver los autolavados en un mapa interactivo para visualizar su ubicación y seleccionar opciones cercanas.",
        "acceptance_criteria": [
            "Mapa integrado con Google Maps muestra todos los resultados como marcadores.",
            "Marcadores diferenciados por color según rating o tipo de servicio.",
            "Click en marcador muestra card con información resumida del proveedor.",
            "Botón para centrar mapa en ubicación actual del usuario.",
            "Zoom y navegación fluida del mapa.",
            "Actualización de resultados al mover/hacer zoom en el mapa.",
            "Opción para alternar entre vista de lista y vista de mapa.",
            "Cálculo y visualización de rutas desde ubicación actual al proveedor seleccionado."
        ],
        "story_points": 8,
        "priority": "Should",
        "epic": "EPI-02",
        "dependencies": [
            "HU-005"
        ]
    },
    {
        "id": "HU-008",
        "title": "Comparación de precios entre proveedores",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero comparar precios y servicios entre diferentes autolavados para tomar la mejor decisión.",
        "acceptance_criteria": [
            "Opción para agregar proveedores a una lista de comparación (máximo 4).",
            "Tabla comparativa muestra: nombre, precios por servicio, rating, distancia, horarios, servicios incluidos.",
            "Destacado visual de mejor precio para cada servicio.",
            "Opción para eliminar proveedores de la comparación.",
            "Botón de acción rápida para reservar desde la tabla comparativa.",
            "Comparación persiste al navegar (guardada en sesión).",
            "Exportar comparación como PDF o imagen para compartir.",
            "Indicadores visuales de diferencia de precio porcentual."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-03",
        "dependencies": [
            "HU-005"
        ]
    },
    {
        "id": "HU-009",
        "title": "Visualización de detalles del proveedor",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero ver información detallada de un autolavado para conocer todos sus servicios, precios y características.",
        "acceptance_criteria": [
            "Información mostrada: nombre, descripción, dirección completa, teléfono, email, sitio web.",
            "Galería de imágenes del local y servicios.",
            "Listado completo de servicios con precios, descripciones y duración.",
            "Horarios de atención por día de la semana.",
            "Mapa embebido mostrando ubicación exacta.",
            "Sección de reseñas y calificaciones de otros usuarios.",
            "Rating promedio y cantidad de reseñas.",
            "Botón destacado para reservar servicio.",
            "Información sobre promociones activas."
        ],
        "story_points": 5,
        "priority": "Must",
        "epic": "EPI-03",
        "dependencies": [
            "HU-005"
        ]
    },
    {
        "id": "HU-010",
        "title": "Gestión de lista de favoritos",
        "role": "Usuario/Cliente",
        "description": "Como usuario registrado, quiero guardar mis autolavados favoritos para acceder rápidamente a ellos en futuras búsquedas.",
        "acceptance_criteria": [
            "Botón de \"favorito\" (corazón) visible en cada card de proveedor.",
            "Toggle para agregar/quitar de favoritos con feedback visual inmediato.",
            "Página dedicada \"Mis Favoritos\" accesible desde menú principal.",
            "Favoritos se sincronizan entre dispositivos (guardados en BD).",
            "Opción para organizar favoritos (ordenar, categorizar).",
            "Notificaciones opcionales cuando favoritos tienen nuevas promociones.",
            "Contador de favoritos en el menú de usuario."
        ],
        "story_points": 5,
        "priority": "Should",
        "epic": "EPI-01",
        "dependencies": [
            "HU-002",
            "HU-005"
        ]
    },
    {
        "id": "HU-011",
        "title": "Visualización de historial de búsquedas",
        "role": "Usuario/Cliente",
        "description": "Como usuario registrado, quiero ver mi historial de búsquedas para repetir búsquedas frecuentes rápidamente.",
        "acceptance_criteria": [
            "Sección \"Historial\" accesible desde el perfil de usuario.",
            "Listado de últimas 20 búsquedas con fecha y filtros aplicados.",
            "Click en una búsqueda histórica la ejecuta nuevamente.",
            "Opción para eliminar búsquedas individuales del historial.",
            "Opción para limpiar todo el historial.",
            "Búsquedas se guardan con: ubicación, filtros, fecha.",
            "Privacidad: historial visible solo para el usuario propietario."
        ],
        "story_points": 3,
        "priority": "Could",
        "epic": "EPI-01",
        "dependencies": [
            "HU-002",
            "HU-005"
        ]
    },
    {
        "id": "HU-012",
        "title": "Sistema de reseñas y calificaciones",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero dejar reseñas y calificaciones sobre autolavados para compartir mi experiencia y ayudar a otros usuarios.",
        "acceptance_criteria": [
            "Formulario de reseña incluye: calificación general (1-5 estrellas), título, comentario.",
            "Criterios específicos de evaluación: calidad del servicio, limpieza, relación precio-calidad, amabilidad del personal.",
            "Validación: solo usuarios con reservas completadas pueden dejar reseñas.",
            "Opción para subir hasta 3 fotos con la reseña.",
            "Sistema de moderación: reseñas pasan por aprobación antes de publicarse.",
            "Usuarios pueden editar sus reseñas dentro de 7 días.",
            "Proveedores pueden responder a reseñas.",
            "Reseñas se ordenan por más recientes o más útiles (likes).",
            "Detección de lenguaje inapropiado automática."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-04",
        "dependencies": [
            "HU-013"
        ]
    },
    {
        "id": "HU-013",
        "title": "Reserva de servicio de lavado",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero reservar un servicio de autolavado para asegurar mi turno en el horario deseado.",
        "acceptance_criteria": [
            "Desde el perfil del proveedor, acceso a calendario de disponibilidad.",
            "Selección de servicio, fecha y hora disponible.",
            "Formulario para ingresar datos del vehículo (marca, modelo, patente).",
            "Campo opcional para notas especiales al proveedor.",
            "Resumen de reserva con: servicio, precio, fecha/hora, duración estimada.",
            "Confirmación requiere usuario autenticado.",
            "Se envía email de confirmación con detalles de la reserva.",
            "Notificación push al proveedor de nueva reserva.",
            "Generación de código QR o ID único de reserva.",
            "Opción de agregar reserva al calendario del dispositivo."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-05",
        "dependencies": [
            "HU-002",
            "HU-009"
        ]
    },
    {
        "id": "HU-014",
        "title": "Cancelación de reserva",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero cancelar una reserva para liberar el turno si no puedo asistir.",
        "acceptance_criteria": [
            "En \"Mis Reservas\", botón de cancelar visible para reservas futuras.",
            "Política de cancelación visible: permitida hasta 2 horas antes.",
            "Confirmación doble antes de cancelar (evitar cancelaciones accidentales).",
            "Campo opcional para indicar motivo de cancelación.",
            "Se envía notificación al proveedor de la cancelación.",
            "Email de confirmación de cancelación al usuario.",
            "La disponibilidad se actualiza inmediatamente para otros usuarios.",
            "Reservas pasadas no pueden cancelarse."
        ],
        "story_points": 3,
        "priority": "Must",
        "epic": "EPI-05",
        "dependencies": [
            "HU-013"
        ]
    },
    {
        "id": "HU-015",
        "title": "Visualización de historial de reservas",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero ver mi historial de reservas para llevar control de los servicios que he utilizado.",
        "acceptance_criteria": [
            "Sección \"Mis Reservas\" accesible desde el perfil de usuario.",
            "Pestañas para: \"Próximas\", \"Pasadas\", \"Canceladas\".",
            "Cada reserva muestra: proveedor, servicio, fecha/hora, estado, precio.",
            "Opción para ver detalles completos de cada reserva.",
            "Desde reservas pasadas, acceso directo para dejar reseña.",
            "Opción para repetir una reserva pasada (pre-llenado de datos).",
            "Exportar historial completo a PDF."
        ],
        "story_points": 3,
        "priority": "Should",
        "epic": "EPI-05",
        "dependencies": [
            "HU-013"
        ]
    },
    {
        "id": "HU-016",
        "title": "Notificaciones push de recordatorios",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero recibir notificaciones sobre mis reservas y actualizaciones relevantes para no perder información importante.",
        "acceptance_criteria": [
            "Notificación de confirmación al realizar una reserva.",
            "Recordatorio 24 horas antes de la cita.",
            "Recordatorio 1 hora antes de la cita.",
            "Alerta si el proveedor cancela o modifica la reserva.",
            "Notificaciones de nuevas promociones en favoritos (opcional).",
            "Alerta cuando bajan precios en búsquedas guardadas.",
            "Configuración granular en perfil: activar/desactivar por tipo de notificación.",
            "Soporte para iOS y Android (usando Firebase Cloud Messaging).",
            "Notificaciones in-app además de push."
        ],
        "story_points": 5,
        "priority": "Should",
        "epic": "EPI-01",
        "dependencies": [
            "HU-002",
            "HU-013"
        ]
    },
    {
        "id": "HU-017",
        "title": "Recomendaciones personalizadas con IA",
        "role": "Usuario/Cliente",
        "description": "Como usuario, quiero recibir recomendaciones personalizadas de autolavados para descubrir opciones que se ajusten a mis preferencias.",
        "acceptance_criteria": [
            "Sección \"Recomendado para ti\" en el dashboard del usuario.",
            "Algoritmo considera: ubicaciones frecuentes, servicios utilizados, rango de precios, ratings preferidos.",
            "Recomendaciones se actualizan semanalmente o tras nuevas interacciones.",
            "Explicación breve de por qué se recomienda cada proveedor.",
            "Opción para \"no volver a recomendar\" un proveedor específico.",
            "Métricas de precisión: tracking de conversión de recomendaciones.",
            "Integración con OpenAI API para análisis de patrones.",
            "Fallback a recomendaciones basadas en popularidad si no hay suficiente historial."
        ],
        "story_points": 13,
        "priority": "Could",
        "epic": "EPI-06",
        "dependencies": [
            "HU-002",
            "HU-005",
            "HU-013"
        ]
    },
    {
        "id": "HU-018",
        "title": "Registro de proveedor",
        "role": "Proveedor",
        "description": "Como proveedor de servicios de autolavado, quiero registrarme en la plataforma para ofrecer mis servicios y captar nuevos clientes.",
        "acceptance_criteria": [
            "Formulario de registro específico para proveedores con campos: nombre del negocio, tipo de negocio, RUT, dirección, teléfono, email, sitio web.",
            "Validación de RUT único en el sistema.",
            "Carga de documentos: patente comercial, certificado tributario.",
            "Selección en mapa de ubicación exacta del negocio.",
            "Creación de cuenta de usuario asociada (email/contraseña).",
            "Estado inicial: \"Pendiente de Aprobación\".",
            "Notificación a administradores de nuevo registro pendiente.",
            "Email de confirmación al proveedor indicando proceso de revisión."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-07",
        "dependencies": []
    },
    {
        "id": "HU-019",
        "title": "Gestión de perfil de negocio",
        "role": "Proveedor",
        "description": "Como proveedor, quiero editar el perfil de mi negocio para mantener la información actualizada y atractiva para potenciales clientes.",
        "acceptance_criteria": [
            "Campos editables: descripción del negocio, teléfono, email, sitio web, redes sociales.",
            "Gestión de galería de imágenes: subir, ordenar, eliminar (máximo 10 imágenes).",
            "Actualización de horarios de atención por día de la semana.",
            "Indicación de días bloqueados (vacaciones, mantenimiento).",
            "Configuración de políticas de cancelación.",
            "Todos los cambios requieren re-aprobación administrativa si son sustanciales.",
            "Preview de cómo se ve el perfil para los clientes.",
            "Validación de formatos (URLs, teléfonos)."
        ],
        "story_points": 5,
        "priority": "Must",
        "epic": "EPI-07",
        "dependencies": [
            "HU-018"
        ]
    },
    {
        "id": "HU-020",
        "title": "Gestión de catálogo de servicios",
        "role": "Proveedor",
        "description": "Como proveedor, quiero gestionar mi catálogo de servicios para ofrecer información clara de precios y características a los clientes.",
        "acceptance_criteria": [
            "Crear nuevo servicio con: nombre, descripción, tipo, precio, duración, servicios incluidos.",
            "Editar servicios existentes.",
            "Activar/desactivar servicios temporalmente.",
            "Eliminar servicios (soft delete).",
            "Configurar servicios destacados.",
            "Agregar imágenes específicas por servicio.",
            "Definir requisitos especiales (ej: \"solo para vehículos pequeños\").",
            "Configurar descuentos o precio promocional.",
            "Orden de visualización personalizable (drag & drop)."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-07",
        "dependencies": [
            "HU-018"
        ]
    },
    {
        "id": "HU-021",
        "title": "Configuración de horarios disponibles",
        "role": "Proveedor",
        "description": "Como proveedor, quiero configurar mis horarios de disponibilidad para que los clientes solo puedan reservar en momentos en que puedo atenderlos.",
        "acceptance_criteria": [
            "Configuración de horario base semanal (ej: Lun-Vie 9:00-18:00).",
            "Definición de duración de slots (15, 30, 60 minutos).",
            "Capacidad máxima de reservas simultáneas por slot.",
            "Bloqueo de fechas específicas (feriados, vacaciones).",
            "Bloqueo de horarios específicos dentro de un día.",
            "Vista de calendario mostrando disponibilidad actual.",
            "Ajuste de antelación mínima y máxima para reservas.",
            "Sincronización automática con sistema de reservas."
        ],
        "story_points": 5,
        "priority": "Must",
        "epic": "EPI-07",
        "dependencies": [
            "HU-018"
        ]
    },
    {
        "id": "HU-022",
        "title": "Gestión de reservas recibidas",
        "role": "Proveedor",
        "description": "Como proveedor, quiero gestionar las reservas que recibo para confirmar, modificar o rechazar citas según mi disponibilidad real.",
        "acceptance_criteria": [
            "Dashboard de reservas con pestañas: Pendientes, Confirmadas, En Progreso, Completadas, Canceladas.",
            "Cada reserva muestra: cliente, servicio, fecha/hora, detalles del vehículo, notas especiales.",
            "Acciones disponibles: Confirmar, Rechazar, Reprogramar, Marcar como completada.",
            "Notificación automática al cliente de cada cambio de estado.",
            "Filtros por fecha, servicio, estado.",
            "Vista de calendario con todas las reservas.",
            "Opción para contactar al cliente directamente (llamada/email).",
            "Exportar listado de reservas a Excel/PDF."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-05",
        "dependencies": [
            "HU-018",
            "HU-021"
        ]
    },
    {
        "id": "HU-023",
        "title": "Dashboard de estadísticas del proveedor",
        "role": "Proveedor",
        "description": "Como proveedor, quiero ver estadísticas de mi negocio para analizar el rendimiento y tomar decisiones informadas.",
        "acceptance_criteria": [
            "Métricas principales: total de reservas, tasa de conversión, ingresos estimados, rating promedio.",
            "Gráficos de evolución temporal (reservas por semana/mes).",
            "Servicios más populares y menos solicitados.",
            "Horarios de mayor demanda (heatmap).",
            "Análisis de reviews: promedio por criterio, palabras más mencionadas.",
            "Comparación con periodo anterior (% de crecimiento).",
            "Filtros por rango de fechas personalizado.",
            "Exportar reportes a PDF.",
            "Visualizaciones con gráficos interactivos (Chart.js o similar)."
        ],
        "story_points": 13,
        "priority": "Should",
        "epic": "EPI-07",
        "dependencies": [
            "HU-018",
            "HU-022"
        ]
    },
    {
        "id": "HU-024",
        "title": "Gestión de promociones y descuentos",
        "role": "Proveedor",
        "description": "Como proveedor, quiero crear promociones y descuentos para atraer más clientes y aumentar reservas.",
        "acceptance_criteria": [
            "Crear promoción con: título, descripción, tipo de descuento (%, monto fijo), valor.",
            "Definir servicios aplicables o si aplica a todos.",
            "Configurar vigencia (fecha inicio y fin).",
            "Establecer límite de usos (opcional).",
            "Mínimo de compra requerido (opcional).",
            "Promociones aparecen destacadas en el perfil del proveedor.",
            "Usuarios reciben notificación si tienen al proveedor en favoritos.",
            "Tracking de uso de cada promoción.",
            "Activar/desactivar promociones manualmente."
        ],
        "story_points": 8,
        "priority": "Should",
        "epic": "EPI-07",
        "dependencies": [
            "HU-018",
            "HU-020"
        ]
    },
    {
        "id": "HU-025",
        "title": "Respuesta a reseñas de clientes",
        "role": "Proveedor",
        "description": "Como proveedor, quiero responder a las reseñas de mis clientes para mostrar atención al feedback y mejorar mi reputación.",
        "acceptance_criteria": [
            "Visualización de todas las reseñas recibidas con estado (respondida/sin responder).",
            "Campo de texto para redactar respuesta pública.",
            "Respuestas tienen límite de caracteres (500).",
            "Notificación al cliente cuando el proveedor responde su reseña.",
            "Editar respuesta dentro de 24 horas de publicada.",
            "Las respuestas aparecen debajo de cada reseña en el perfil público.",
            "Filtro para ver solo reseñas negativas (≤3 estrellas) para atención prioritaria."
        ],
        "story_points": 5,
        "priority": "Should",
        "epic": "EPI-04",
        "dependencies": [
            "HU-018",
            "HU-012"
        ]
    },
    {
        "id": "HU-026",
        "title": "Sistema de verificación de proveedores",
        "role": "Admin",
        "description": "Como administrador, quiero verificar y aprobar proveedores nuevos para asegurar la calidad de la plataforma.",
        "acceptance_criteria": [
            "Lista de proveedores pendientes de aprobación.",
            "Vista detallada de solicitud con todos los datos y documentos subidos.",
            "Validación de RUT mediante servicio del SII (API externa).",
            "Verificación de documentos comerciales.",
            "Acciones: Aprobar, Rechazar, Solicitar más información.",
            "Campo para notas internas visibles solo para admins.",
            "Notificación automática al proveedor del resultado.",
            "Si se aprueba, cambio de estado a \"Activo\" y perfil visible públicamente.",
            "Si se rechaza, especificar motivo que se comunica al proveedor."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-08",
        "dependencies": [
            "HU-018"
        ]
    },
    {
        "id": "HU-027",
        "title": "Dashboard administrativo completo",
        "role": "Admin",
        "description": "Como administrador, quiero tener un dashboard general para monitorear todas las métricas clave de la plataforma.",
        "acceptance_criteria": [
            "Métricas principales: total usuarios activos, total proveedores, reservas del mes, ingresos (si aplica comisión).",
            "Gráficos de crecimiento (usuarios, proveedores, reservas).",
            "Listado de actividad reciente (nuevos registros, reservas, reseñas).",
            "Alertas de acciones pendientes (proveedores por aprobar, reseñas por moderar).",
            "Estadísticas de uso: búsquedas, conversión a reserva, tasa de cancelación.",
            "Proveedores top por rating y por cantidad de reservas.",
            "Mapa de calor de actividad por zona geográfica.",
            "Acceso rápido a todas las funciones administrativas.",
            "Filtros temporales para todas las métricas."
        ],
        "story_points": 13,
        "priority": "Must",
        "epic": "EPI-08",
        "dependencies": []
    },
    {
        "id": "HU-028",
        "title": "Gestión de usuarios y moderación",
        "role": "Admin",
        "description": "Como administrador, quiero gestionar usuarios y contenido para mantener la calidad y seguridad de la plataforma.",
        "acceptance_criteria": [
            "Búsqueda y listado de todos los usuarios (clientes y proveedores).",
            "Vista detallada de perfil de usuario con toda su actividad.",
            "Acciones: Suspender, Reactivar, Eliminar cuenta.",
            "Moderación de reseñas reportadas por contenido inapropiado.",
            "Aprobación/rechazo de reseñas pendientes.",
            "Editar o eliminar contenido que viole políticas.",
            "Sistema de reportes de usuarios problemáticos.",
            "Log de todas las acciones administrativas realizadas."
        ],
        "story_points": 8,
        "priority": "Must",
        "epic": "EPI-08",
        "dependencies": [
            "HU-001",
            "HU-012"
        ]
    },
    {
        "id": "HU-029",
        "title": "Configuración de parámetros del sistema",
        "role": "Admin",
        "description": "Como administrador, quiero configurar parámetros generales del sistema para personalizar el comportamiento de la plataforma.",
        "acceptance_criteria": [
            "Configuraciones de reservas: tiempo mínimo de antelación, política de cancelación por defecto.",
            "Parámetros de búsqueda: radio máximo, límite de resultados.",
            "Configuración de notificaciones: tiempos de recordatorio, tipos activos.",
            "Políticas de moderación: palabras prohibidas, umbral de reportes.",
            "Configuración de comisiones (si aplica modelo de negocio).",
            "Textos legales: términos y condiciones, política de privacidad.",
            "Configuración de emails: templates, remitente.",
            "Todos los cambios quedan registrados en log de auditoría."
        ],
        "story_points": 5,
        "priority": "Should",
        "epic": "EPI-08",
        "dependencies": []
    },
    {
        "id": "HU-030",
        "title": "Scraping y agregación de datos",
        "role": "Sistema",
        "description": "Como sistema, quiero scrapear y agregar datos de múltiples fuentes para mantener un catálogo actualizado de proveedores.",
        "acceptance_criteria": [
            "Scrapers configurables para: Google Maps API, Yapo.cl, páginas web públicas.",
            "Extracción automática de: nombre, dirección, teléfono, servicios, precios, horarios, coordenadas.",
            "Validación y normalización de datos extraídos.",
            "Detección de duplicados mediante comparación de nombre y ubicación.",
            "Almacenamiento en base de datos con marca de fuente de origen.",
            "Sistema de importación masiva con revisión administrativa previa.",
            "Actualización automática programada (semanal).",
            "Log de errores y estadísticas de scraping.",
            "Exportación de datos a múltiples formatos (JSON, CSV, SQL).",
            "Respeto de políticas de scraping y rate limits."
        ],
        "story_points": 13,
        "priority": "Must",
        "epic": "EPI-06",
        "dependencies": []
    }
]